Revit 2024 API
BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailable Property
 There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailable { get; }
Visual Basic
Public Shared ReadOnly Property NotEnoughSlotsOnlyLugAvailable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotEnoughSlotsOnlyLugAvailable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace